Revit 2027 API
ProjectLocationSet.Contains Method
Tests for the existence of a project location within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	ProjectLocation item
)
Public Overridable Function Contains (
	item As ProjectLocation
) As Boolean
public:
virtual bool Contains(
	ProjectLocation^ item
)
abstract Contains :
        item : ProjectLocation -> bool
override Contains :
        item : ProjectLocation -> bool
Parameters
item ProjectLocation
The project location to be searched for.
Return Value
Boolean
The Contains method returns True if the project location is within the set, otherwise False.
See Also
Reference
ProjectLocationSet Class
Autodesk.Revit.DB Namespace